const home = {
  landing: {
    title: "استمتع بأحدث وأقوى منصة للرسائل البريدية",
    highlightedTitle: "للرسائل البريدية",
    description: "نظام مراسلة بمفهوم جديد يوفر كل ما تحتاجه في عالم المراسلات",
    buttons: {
      discoverServices: "اكتشف الخدمات",
      pricingPlans: "خطط الأسعار",
    },
    imageAlt: "صورة رئيسية",
  },
  about: {
    titleImageAlt: "عنوان قسم من نحن",
    description:
      "تقدم خدمة EmailSender من SolomDev0 Ltd، الرائدة في مجال الاتصالات الرقمية ومقرها لندن، للشركات إمكانية إرسال رسائل SMS باستخدام هويات مرسلة مخصصة، مما يعزز الاحترافية والثقة. تدعم الخدمة الرسائل الفردية والجماعية، مما يتيح إرسال إشعارات مستهدفة أو حملات واسعة النطاق. يمكن التكامل عبر واجهات برمجة التطبيقات (APIs) مع أدوات مثل أنظمة إدارة العلاقات مع العملاء (CRMs) ومنصات التجارة الإلكترونية لأتمتة وتخصيص الاتصالات. تشمل الميزات الرئيسية:<br /><br />• المراسلة المرنة: تدعم الرسائل المستهدفة والجماعية<br />• التكامل مع واجهات برمجة التطبيقات: يتصل مع الأنظمة الداخلية للأتمتة<br />• أرشيف الرسائل: يتتبع عمليات التسليم، يحلل الحملات ويضمن تحسين الأداء<br /><br />هذا الحل المبتكر يمكن الشركات من التواصل بشكل آمن، فعال واحترافي.",
    imageAlt: "صورة عن الخدمة",
  },
  services: {
    titleImageAlt: "عنوان الخدمات",
    description:
      "تميزت الشركة بتقديم وتطوير خدمات البريد الإلكتروني بأحدث التقنيات، جودة عالية ودعم فني مستمر على مدار الساعة، مما يضعها في طليعة الشركات الرائدة في هذا المجال.",
    items: [
      {
        title: "إرسال متعدد",
        description:
          "يتيح الإرسال المتعدد للبريد الإلكتروني إمكانية إرسال رسائل نصية إلى عدة مستلمين في وقت واحد. تُستخدم هذه الميزة عادةً للرسائل الجماعية، مما يمكن الشركات من إرسال العروض الترويجية والتنبيهات والتذكيرات أو التحديثات بشكل فعال لجمهور كبير. توفر الوقت، تضمن اتصالاً متسقاً وتدعم محتوى مخصصاً من خلال ميزات مثل الحقول الديناميكية للأسماء أو التفاصيل.",
      },
      {
        title: "قوالب البريد",
        description:
          "قوالب البريد الإلكتروني في المنصة هي نماذج رسائل مصممة مسبقاً تبسط عملية التواصل من خلال السماح للمستخدمين بإنشاء وإعادة استخدام الرسائل النصية الموحدة. توفر هذه القوالب الوقت، تضمن الاتساق وتقلل من الأخطاء، خاصة للرسائل المتكررة مثل التأكيدات والتذكيرات والعروض الترويجية أو التنبيهات. يمكن في الغالب تخصيصها بوضع عناصر نائبة للتفاصيل الخاصة بالمستلم مثل الأسماء أو التواريخ.",
      },
      {
        title: "دعم فني على مدار الساعة",
        description:
          "يوفر الدعم الفني على مدار الساعة لمنصة البريد الإلكتروني المساعدة المستمرة لأي مشاكل أو استفسارات تتعلق بالمنصة. تقدم هذه الخدمة إرشادات خبراء في استكشاف الأخطاء وإصلاحها، الإعداد، إدارة الحملات وتكاملات واجهة برمجة التطبيقات، مما يضمن عمليات بريد إلكتروني سلسة وغير منقطعة. تعزز ثقة المستخدم من خلال تقديم حلول سريعة عبر قنوات متعددة مثل الدردشة والبريد الإلكتروني.",
      },
    ],
  },
  resellers: {
    titleImageAlt: "عنوان الموزعين",
    title: "هل ترغب في أن تصبح موزعًا معتمدًا لخدمة الرسائل القصيرة؟",
    description:
      "اطلب مشروعك الآن وقم بإدارة الحسابات الفرعية من خلال أفضل منصة مراسلة.",
    features: [
      "تفعيل حسابك عبر OTP والبريد الإلكتروني.",
      "نظام رسائل قصيرة يحمل اسمك التجاري وشعارك.",
      "تقارير توضح أرصدة الحسابات الفرعية والرسائل المرسلة.",
      "إرسال تذكيرات المواعيد.",
      "تقديم حجوزاتك.",
    ],
    imageAlt: "موزع",
  },
  contact: {
    titleImageAlt: "عنوان اتصل بنا",
    description: "سنرد عليك قريباً.",
    labels: {
      fullname: "الاسم الكامل",
      phone: "رقم الهاتف",
      email: "البريد الإلكتروني",
      company: "اسم الشركة",
      message: "الرسالة",
    },
    placeholders: {
      fullname: "أدخل الاسم الكامل",
      phone: "أدخل رقم الهاتف",
      email: "أدخل البريد الإلكتروني",
      company: "أدخل اسم الشركة",
      message: "أدخل الرسالة",
    },
    button: "إرسال",
    imageAlt: "اتصل بنا",
    errors: {
      requiredFields: "الرجاء ملء جميع الحقول",
      sendFailure: "فشل إرسال الرسالة!",
    },
    success: {
      sendSuccess: "تم إرسال الرسالة بنجاح!",
    },
  },
} as const;

export default home;
